Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J25.tmx
Source language: en_us
Languages: zh_cn

source: Behavioral scientists were first brought into the design process to shed light on the needs of future occupants.
zh_cn: 行为科学家参与设计为满足未来使用者的需要带来了光明。

source: Since psychologists had expert knowledge on the ways in which people responded to light, color, and proportion, sociologists about the nature of social organization in neighborhoods, and anthropologists on buildings as symbols and artifacts, it was hoped that they would be able to apply this knowledge to the design process.
zh_cn: 既然心理学家在人对光、色彩和比例的反应方面有专门知识，社会学家对邻里社会组织的本质有专业研究，而人类学家对建筑作为文化的象征和人工产品有深入的研究，因此他们的参与为这些知识在设计过程中的应用带来了希望。

source: This approach faltered for a number of reasons.
zh_cn: 然而它的发展并不稳定，其原因如下：

source: The findings collected in basic research could not be applied with any confidence.
zh_cn: 首先，行为科学的基础研究成果不能随心所欲地运用。

source: Color perception was one of the oldest topics in experimental psychology, but if an experimental psychologist were asked to specify the colors that should be used in a bus station, the answer was likely to be vague and uncertain.
zh_cn: 色彩知觉是实验心理学中最古老的研究课题，但如果要问一位实验心理学家，设计一座公共汽车站该选择什么颜色，回答可能是含糊而不肯定的。

source: Nor was research on space perception, another traditional research topic, useful for understanding orientation in buildings and neighborhoods.
zh_cn: 空间知觉是另一个传统研究课题，在帮助人们理解建筑和邻里的定向上用处不大。

source: Sociologists had done considerable research on neighborhood networks, but their findings were usually too general to assist the city planner.
zh_cn: 社会学家们在邻里网络上进行了相当的研究，但他们的研究对城市规划师来说显得太概括而起不到辅助作用。

source: Needs analysis went through several stages in its evolution and is still changing.
zh_cn: 需要分析在改进的过程中经历了几个阶段，而且还在继续变化之中。

source: At the outset, designers relied on needs they inferred or extrapolated from basic research studies and from theory.
zh_cn: 一开始设计师是靠推理，从基础研究中得来的计算和理论来了解需要。

source: More recent approaches have tended to dwell less upon inferred needs and more upon direct expression of people's wants, which are obtained through surveys or by the involvement of users in the design process.
zh_cn: 近来的研究在方法上较少依靠推理，而倾向于获得人们愿望的直接表达（通过调研）或通过使用者参与设计来得到。

source: The relationship between needs and wants is full of pitfalls for the unwary. A need is something basic, fundamental, and enduring, as in the need for shelter, sustenance, and social contact, while a want is an expressed preference, and thus is likely to be specific, transient, and more easily changed, as in the desire for a particular brand of food or clothing style.
zh_cn: 需要（needs）是诸如掩蔽、食物、社会接触之类的基本的、必要的、长久的东西，而愿望（wants）是表达一种选择，因此它更为具体、短暂而易变，比如喜好某个牌子的食物或衣服样式。

source: Human needs have traditionally been regarded as more acceptable topics of study than wants in the behavioral sciences. The investigation of preferences is considered to be a second-rate applied task, more akin to marketing than to serious scholarship.
zh_cn: 习惯上认为人的需要是较愿望更易接受的研究课题，而认为愿望的调查属于低一个层次的应用课题，更接近市场而非严肃的学术研究。

source: This dual standard has its roots in the platonic view that appearances are deceptive and ephemeral and that the important reality lies underneath.
zh_cn: 这种双重的学术标准来源于柏拉图的哲学观，这种观点认为表面现象具有欺骗性、短暂性，而重要的现实总隐藏在下面。

source: However in some specific eases a firm distinction between needs and wants is difficult to maintain.
zh_cn: 然而在一些具体的情况下，需要和愿望是难有绝对的区分的。

source: Some architects and urban planners looked to the behavioral sciences not for specific bits of information that could be applied on particular projects but for general theories of human behavior that could be generalized to many settings.
zh_cn: 过去一些建筑师和规划师指望行为科学不仅提供可用于特殊项目的具体信息，而且希望得到普适于许多场合的关于人的一般理论。

source: Some designers found what they wanted to know about perception in the writings of James J. Gibson and Rudolf Arnheim; about the desire for stimulation and variety in the work of D. O. Hebb and Daniel Berlyne; and about social life within neighborhoods from Herbert Gans and Louis Wirth.
zh_cn: 一些设计师认为他们要理解J·吉布森和R·阿恩海姆的关于知觉的理论；要理解D·O·赫布和D·伯莱尼对人渴望刺激和差异性的研究；要理解H·甘斯和L·韦斯对邻里社会生活的研究。

source: This interest in general theories remains strong today and co-exists with the desire for place-specific information.
zh_cn: 时至今日，人们对一般性理论的兴趣依然很浓，同时仍保持着寻求特定场所信息的愿望。

source: A mutual learning regarding what each can obtain from the other has occurred in the dialogue between designers and behavioral scientists.
zh_cn: 从设计师和行为科学家的对话中，能彼此了解从对方可以获得些什么。

source: Initially, architects complained that the social scientists' answers were too general, tentative, and often came too late to be useful.
zh_cn: 刚开始，建筑师常会抱怨行为科学家的回答太笼统、只是试验性的，而且来得太迟以至于错过了良机；

source: Behavioral scientists criticized the architects' queries as being too specific, time-pressured, and deterministic in assuming a direct connection between building elements and behavioral patterns.
zh_cn: 行为科学家则批评建筑师的问题太具体、时间紧，而且在建筑元素和行为类型的联系上过于武断。

source: One of the most useful contributions that social scientists have made to design was to point out that design does not alone determine behavior. Even when it strongly influences how people behave, the effects are not direct but are mediated through psycho-social factors;
zh_cn: 行为科学家对设计作出的最重要的贡献是指出：单是凭设计并不能决定行为，甚至当它对人们产生很大的影响时，这个效果也并不是直接的，而是通过社会因素来协同作用的。

source: for example, different people will be affected differently by the same building, depending upon whether they are alone or in a group, happy or sad, or are visiting for the first time or are accustomed to the place.
zh_cn: 例如，同样一幢建筑对不同的人的影响就不同，这取决于他是单个的、还是群体的，快乐的、还是忧伤的，或者，是首次莅临，还是经常光顾。

source: Eventually those designers who wanted to collaborate with behavioral scientists learned how to ask questions that could be answered within the time frame, methods, and data base of the social sciences, and those behavioral scientists active in the collaboration learned to produce timely and relevant reports. All this took time and patience on everyone’s part.
zh_cn: 那些想同行为科学家合作的设计师最终学会了怎样问一些在时间框架、方法和社会科学数据基础上可行的问题，而那些合作积极的行为科学家会学习写出及时的、相关的学术报告，所有这些对于每个人来说都需要时间和耐心。

source: Effective collaboration between people in different fields, especially those as distinct in training and temperament as design and behavioral science, does not come easily.
zh_cn: 不同领域的研究人员之间进行有效的合作并不容易，尤其是对分别从事设计和行为科学的人来说，他们所接受的训练和自身的气质都明显不同。

source: Needs Assessment Survey
zh_cn: 需要评价调查

source: Another approach to needs analysis came not from basic research or from theory, but from marketing, and involved asking people what they wanted in the way of work or living space.
zh_cn: 需要分析的另一途径并不是靠基础研究或理论，而是来自市场，它涉及询问人们在工作和生活空间中想要些什么。

source: This blurs the distinction between needs and wants, since it assumes that people’s responses will bear some relationship to both.
zh_cn: 既然它认为人们的回答包含了需要和愿望之间的一些关系，这也就模糊了两者的界限。

source: Studies of expressed preference are of interest to the social scientist and useful to industry.
zh_cn: 有关人们愿望的研究对产业方面也很有用，社会科学家一直对此兴趣浓厚。

source: The value of such studies increases if they identify the particular properties inherent in the object on which the preference or rejection is based.
zh_cn: 如果他们发现某物的一种属性导致人们接纳或拒绝，则这项研究的价值就会愈来愈高。

source: Technically it would have been more accurate to title this chapter Wants Analysis, but I have followed the conventional practice of discussing “needs”, since, from a practical standpoint, needs are more saleable than wants.
zh_cn: 从技术上说本文冠名“愿望分析”会更精确些。既然从实践的角度出发，需要较愿望更易于为人们所接受，于是我仍采用讨论需要的传统实践形式。

source: Managers are more likely to respond positively when they are told that employees need something than when they are told that employees want it.
zh_cn: 当经理们被告知职员需要某物时，比告诉他们职员想要什么更易接受。

source: The latter statement is likely to provoke the response, “Yes, we know they want it, but we can't a fiord to give it to them.
zh_cn: 后一种陈述很可能得到这样一种反应：“对，我们知道他们想要，但我们负担不起。

source: However, if our workers need it then that is another matter.”
zh_cn: 如果我们的工人需要这样，那就另当别论了。”

source: In some ways this is a semantics game, more akin to diplomacy than science.
zh_cn: 在某种程度上这是一种语言游戏，更像外交手腕而非科学本领。

source: Economists speak of actual behavior in the marketplace as “revealed preferences,” meaning that the behavior of people in purchasing goods and services reveals their wants and preferences.
zh_cn: 经济学家认为市场中的随机行为就是“意愿的展示”，亦即人们购买物品和服务的行为展示了他们的意愿和选择。

source: This approach is not valid in mast designed spaces that are not “purchased” by their occupants. Nor can people’s attitudes towards the architecture or interior layout be discerned by how long they remain inside.
zh_cn: 这种方法在大多数设计的空间中都不成立，因为设计的空间并非为其使用者购买，人们对建筑和室内布置的态度也因他们在其中活动时间的长短而不同。

source: The failure of market mechanisms to reveal preferences and levels of occupant satisfaction with designed spaces created a niche for formal techniques for gauging occupant response.
zh_cn: 市场方法在揭示人们对设计空间的意愿和满意度上的失败为创立量度使用者反应的正规方法提供了位置。

source: Most designers claim to be meeting market demands to some degree, but the distinctive feature of UNA (user needs analysis) is that it is carried out in a systematic manner.
zh_cn: 大多数设计师都要在某种程度上迎俣市场的要求，但使用者需要分析的特征是权一种系统的方式来进行。

source: This requires the use of standardized techniques for collecting information (interviews, questionnaires, and so on) and some sampling of occupants and their activities.
zh_cn: 它要求采用收集信息的标准技术（访谈、问询表等等）和用户及其行为的抽样。

source: Without formal procedures for selecting people to be interviewed and ways of asking questions, the technique does not qualify as a UNA.
zh_cn: 如无选择访问对象和提问的正规程序，这种技术就不能称为使用者需要分析（User Need Analysis，缩写为UNA）。

source: It is not always safe to assume that input from potential occupants of a setting will be more relevant to the design process than input from those in similar facilities.
zh_cn: 在设计过程中引入潜在的作用者并不比引入使用过相似设施的人更有帮助。

source: It may be that the potential occupants have never experienced a building of the same type before.
zh_cn: 那些潜在的使用者有可能对同样类型的建筑未曾体验过。

source: For example, asking teachers and students in a traditional school building what their space and environmental needs would be in an open-plan school building with modular pods housing three grades each may turn up little useful information, unless potential occupants are given some education or experience with open-plan school buildings.
zh_cn: 例如，如果潜在的使用者并未接受过开放的学校空间的教育或有此种空间的体验，这时要是去问这些传统学校的师生：他们在一所由模数空间组合而成的、可容纳三个年级的、开放平面由局的学校中，有何空间需求或环境需求，他们可能提供不了什么有用的信息。

source: Consulting with potential occupants is always desirable when it is possible, both because of the possibility of securing useful information about the residents and their space needs，and because it will satisfy people’s desire to be consulted about changes that affect their lives.
zh_cn: 尽管如此，仍应尽可能谙问一些潜在占有者，因为这既可能保证得到居民及其空间需要的有用信息，又能够满足只们希望了解影响他们生活的那些变化的愿望。

source: An assumption in a needs assessment survey is that potential occupants know what they want and can communicate this to an interviewer.
zh_cn: 进行需要评价调查的前提是潜在作用者知道他们要什么和能够同访问人进行交流。

source: In cases where people are turned off to their physical surroundings and alienated from the decision-making process, this assumption is not valid.
zh_cn: 在有些情况下，人们同周围环境割裂开来而无法以与到决策过程中来，这个前提就不可靠。

source: Most people asked about civic improvements will respond hesitantly and tentatively.
zh_cn: 大多数人在被问到城市环境改变方面的问题时都表现出犹豫不决，或只是提些建议。

source: They have not given much thought to these matters.
zh_cn: 他们对这些事情没有太多的想法。

source: There was no reason for them to be concerned since their opinions had not mattered.
zh_cn: 既然他们的意见无关紧要，他们也就用不阗去关心什么。

source: Even if they have an idea about what they want, they may not have the concepts to convey this to a designer.
zh_cn: 即使他们有些想法，也可能不知道怎样的设计师表达。

source: This calls for some patience on the part of the interviewer in asking the right questions and in waiting for answers to come, just as listening to the speaker of another language requires special patience.
zh_cn: 这就要求访问人有耐心提出恰当的问题，并等待答案。

source: Drawings and models can make design alternatives more tangible to the prospective occupants. People can be shown various options and asked to choose among them.
zh_cn: 设计图纸和模型能够使设计与未来的使用者贴得更近，还可给人们不同的选择项来挑选。

source: The occupant can move around parts of a scale model or even take part in a slide simulation study showing how a building facade will appear in different exterior colors.
zh_cn: 使用者能够围绕模型移动，甚至可以参加一个幻灯模拟演示会，看看建筑立面以不同的形式和色彩显现。

source: The needs survey will be more meaningful when the designer has spent some time among the occupants and knows how they think and express themselves.
zh_cn: 当设计师已花了些时间了解了使用者怎样思考和表达自己之后，需要调查就会更有意义。

source: It would be extremely difficult to conduct a needs analysis in a specialized building without knowing the technical vocabulary of the residents.
zh_cn: 如果对一幢有特殊用途的建筑进行需要分析而又不知使用者们惯用的语汇，工作会很难进行。

source: Experiencing how people use space as a preliminary to design is exemplified in the work of landscape architect Lawrence Halprin.
zh_cn: 景观建筑师L·哈普林在其著作中举例说明如何把体验人们使用空间的方式作为设计的第一步。

source: Before the drawings are put on paper, Halprin and his staff go out into settings like those for which a design is to be conceived and spend time there in order to develop a choreography of people-place relationships in which movement patterns arc paramount.
zh_cn: 在画图之前，哈普林及其同事会去设计现场花些时间将重要活动类型的行为轨迹用草图记录下来。

source: Halprin has used these choreographs to design such successful places as San Francisco’s Ghiradelli Square and the Forecourt and Lovejoy Fountains in Portland, Oregon.
zh_cn: 哈普林已用这种行为草图成功地设计了旧金山的吉拉德里广场、俄勒冈州波特兰市的前庭和爱之乐喷泉。

source: These works illustrate that a design that takes people's activities and interests into account can be exciting, attractive, and in the case of commercial buildings, economically successful.
zh_cn: 这些工程表明：考虑了人们的活动和兴趣的设计能够富有吸引力，使人兴雷；若是商业建筑，还有良好的经济效益。

source: What Halprin did not do was create sculptural forms in his studio and impose them on a location.
zh_cn: 哈普林并没有在他的工作室中做一个雕塑的形式，然后强加给当地。

source: It has been argued that architects should live in the types of buildings that they are designing.
zh_cn: 曾有人提出建筑师应住一住自己设计的建筑。

source: The Urban Development Corporation in New York City has required this of their architects for public housing projects for some time.
zh_cn: 在纽约市，城市开发集团要求为其设计公共住宅的建筑师要在其设计的建筑中住上一段时间。

source: This is not a formal needs analysis, but it is one way of ensuring that the architect comes into direct contact with future occupants.
zh_cn: 这并不是一种正规的需要分析，但它是一种保证同未来使用者建立直接接触的方法。

source: Living among the occupants works better in some places than in others. In preparing an architectural plan for a university, architect Neal Deasy lived for a week in a dormitory and took all his meals in the dining hall.
zh_cn: 有时同使用者一起生活有利于工作，建筑师N·迪塞在为一所大学进行建筑规划的时候，曾在该校一幢宿舍楼中住了一个星期，他每顿饭都在学生餐厅吃。

source: Dressed in a conservative tweed suit and vest, he felt he was “as conspicuous as a piebald aardvark”.
zh_cn: 由于身着花格呢三件套西服，他觉得自己像花斑豚鼠一样若眼。

source: The approach proved more successful in the outdoor areas of the campus. Deasy started his observations at 7:30 a.m. and concluded at 10 p.m. He followed a set course through the campus and noted what was taking place, who was involved, and what they were doing.
zh_cn: 在校园的外部环境规划中证明了他的方法更为成功，他从早上7：30观察到晚上10：00，他要在校园漫步一圈，观察并记录发生了些什么，谁在参与，他们在做什么。

source: Photographs were taken at key locations and were printed on inexpensive proof sheets.
zh_cn: 他在关键的地点拍摄照片，然后将其印在价廉的资料纸上。

source: Having the photographs independently analyzed served as a check on the observer. The pictures were useful in transmitting the architects recommendations to his client.
zh_cn: 照片分析作为对观察者的一种检查，而图片有利于将建筑师的意见传递给业主。

source: Photographs are often more persuasive than words for conveying the realities of human behavior, especially when the behavior is at odds with conventional expectations about how an area is being used.
zh_cn: 照片在反映人的真实行为时较语言更有说服力，特别是当那种行为与场所的习惯使用方式相左时更为有用。

source: Kathryn Anthony has been documenting the costs and benefits of needs analysis in several construction projects undertaken by the architectural office of Patrick Sullivan Associates in San Luis Obispo, California.
zh_cn: K·安托尼曾经考证了加州圣路易·欧比斯堡的P·沙里文呈务所的几项工程中的需要分析的费用和效益。

source: She has been able to show how the needs analysis lowered project costs.
zh_cn: 她证明需要分析能降低工程造价。

source: In the case of two jails, the research showed that a lower level of security hardware and construction were feasible, and in the construction of a city hall, how similar types of work stations could be consolidated.
zh_cn: 在两个监狱工程的案例中，需要分析的研究表明较低水平的保安硬件和建筑构造是可行的，而在一个市政厅的建设中，相似的工作站可“合并设立。

source: On the city hall project, which was scaled down 15 percent because of the efficiency of the open-office modular work stations recommended by the researchers, the client was billed for under 1,300 consultant hours.
zh_cn: 在这个市政厅项目中，由-p采用了研究者们提出的模数化开敞式的工作站计划，而将原规模缩减了15%。业主为此支付了不到l300小时的咨询费。

source: A criticism of needs analysis is that it will awaken false hopes if people assume that they will always get what they request.
zh_cn: 对需要分析的批评主要集中在如果人们认为他们总能得到他们想要的，那就回导致人们错误的期待。

source: This expectation can be avoided, or at least minimized, by a clear statement in the survey that it may not be possible to fulfill everyone's wishes and by clearly stating at the outset the scope, resources, and limitations of the proposed project.
zh_cn: 这只要在调查开始时，说清楚由于项目规模、资源和项目本身的局限性，不可能使每个人的愿望都得到满足，这种期待就可避免，至少是减少。

source: On the other hand, it is necessary that people believe that their suggestions will receive a fair hearing. Otherwise their replies are not likely to be very useful for the UNA.
zh_cn: 另一方面，人们又必须相信他们的建议会得到公正的倾听，否则人们的回答不会对使用者的需要分析有用。
